Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer class provides the means of drawing and removing temporary graphics on a specific view.
Remarks:
During runtime, all code runs in the same thread.
All calls to any public methods are invoked to the AKit thread, therefore no locks are required for this class.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.graphics
The collection of all drawn graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.viewInfo
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view being drawn to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.disposed
Indicates whether Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Dispose has been called one or more times already.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer class.
viewInfo: The description of the view to draw to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Changed
Occurs when the Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsView has changed.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Closed
Occurs when the view is closed.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Identifier
Gets the identifier of the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Info
Gets the Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo describing the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Dispose
Closes the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Draw(Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic)
Draws the given Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic to the view.
Throws System.ObjectDisposedException: Thrown when the current view is disposed.
graphic: The graphic to draw.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.RefreshViewInfo
Refreshes the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Info property and raises Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Changed if a relevant property has changed.
Throws System.ObjectDisposedException: Thrown when the current view is disposed.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.Remove(Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic)
Removes the given Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic from the view.
Throws System.ObjectDisposedException: Thrown when the current view is disposed.
graphic: The graphic to remove.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.AssertDisposed
Asserts the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewDrawer.disposed flag to be false.
Throws System.ObjectDisposedException: Thrown when the current view is disposed.